// 1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для
// приложения, которое является
// а) информационной системой ветеринарной клиники
// б) архивом выставки котов
// в) информационной системой Театра кошек Ю. Д. Куклачёва
// Можно записать в текстовом виде, не обязательно реализовывать в java.
//  Вет клиника.

// Поля:
// Кличка(name)
// Возраст(age)
// Пол(gender)
// Порода(breed)
// Чип(chip)
// Вакцинация(vaccination)
// История болезни(medical history)
// Владелец(owner)

// Методы:
// Получить: getName(), getAge(), ...
// Установить: setName(), setAge(), ...
// Добавить вакцинацию (addVaccine)
// Добавить запись в историю болезни (addNewRecord)

// Выставка котов.

// Поля:
// Кличка(name)
// Возрст(age)
// Пол(gender)
// Порода(breed)
// Чип(chip)
// Вакцинация(vaccination)
// Владелец(owner)
// Метрика(metrix)
// Титулы(titles)

// Методы:
// Получить: getName(), getAge(), ...
// Установить: setName(), setAge(), ...
// Добавить вакцинацию (addVaccine)
// Добавить титул (addTitle)

// Театр.

// Поля:
// Кличка(name)
// Возрст(age)
// Пол(gender)
// Порода(breed)
// Чип(chip)
// Вакцинация(vaccination)
// Тип питания(food type)
// Дрессировщик(trainer)
// Трюки(tricks)

// Методы:
// Получить: getName(), getAge(), ...
// Установить: setName(), setAge(), ...
// Добавить вакцинацию (addVaccine)
// Добавить тип питания (addFoodType)
// Добавить трюк (addTrick)